using System.Collections;
using System.Collections.Generic;

namespace Dialog
{
    public class DialogStrs
    {
        public static string[] manStrsArr = {
            "새 신발 신고 나갔는데\n소나기나 와라!",
            "버스에 지갑이랑\n핸드폰 놓고 내려라!",
            "집에서 레고나 밟아라!",
            "컵라면에 실수로\n찬물이나 부어라!"
        };

        public static string[] manStoryArr = {
            "뭐야, 넌",
            "?"
        };

        public static string[] womanStrsArr = {
            //"양치하고 귤 먹어라",
            //"물 마시다가 사레 걸려라",
            //"컵라면에 찬물 부어라",
            "순살 치킨 시켰는데\n뼈 있어라",
            "아침에 일어나서 문에 새끼발가락 찧어라",
            "양말 한 짝씩 잃어버려서 짝짝이 신고 가라",
            //"귤 많이 먹어서 손 노래져라",
            //"버스에 지갑이랑 핸드폰 놓고내려라",
            //"새로 산 신발 신고 나갔는데 비 와라",
            "외딴 섬에나 떨어져!"
        };

        public static string[] fairyStrsArr = {
            "어떡하죠?\n상대방이 화난것 같아요",
            "전 당신의 게임 플레이를 도와줄 요정이랍니당~\n우선 질수는 없으니 싸우는걸\n도와드릴게요",
            "아래 보이는 키 중 Q를 눌러\n공격해보세요!",
            "잘했어요\n게임에서 승리하기 위해선\n위에 게이지가 어느 한쪽이라도 먼저\n꽉 차면 돼요!",
            "주의 사항은 자신의 게이지가\n먼저 차면 당연히 지게 되겠죠?",
            "그럼 계속 해봐요",
            "어머나 뭐지?\n잠시만요",
            "진짜 외딴 섬에 떨어졌네?\n이러면 안되는데",
            "개발자들이 실수했나?",
            "전 모르겠네용~\n알아서 잘 탈출해봐요",
            "집으로 갈수 있긴 할거에요\n파이팅!!!"
        };
    }
}
